*> Advent of Code 2017 Day 1 Challenge 2
IDENTIFICATION DIVISION.
PROGRAM-ID. DAY1_2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT IN-FILE 
    ASSIGN TO './utils/INPUT.DAT'
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
    FILE SECTION.
        FD IN-FILE.
        01 IN-DIGIT PIC 9.
    WORKING-STORAGE SECTION.
        01 WS-INPUT-TABLE.
            05 WS-DIGIT         PIC 9 OCCURS 2098 TIMES INDEXED BY INX-A, INX-B.
        01 WS-NUM-DIGITS        PIC 9(4) VALUE 2098.
        01 WS-HALFWAY           PIC 9(4) VALUE 1049.
        01 WS-COMP-POS          PIC 9(4).
        01 WS-DIVISION.
            05 WS-QUOTIENT      PIC 9(4).
            05 WS-REMAINDER     PIC 9(4).
        01 WS-DIGCNT        PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
100-MAIN.
    PERFORM 200-ADD-DIGITS-TO-TABLE THRU 200-ADD-DIGITS-TO-TABLE-EXIT
    PERFORM 300-FIND-ANSWER THRU 300-FIND-ANSWER-EXIT
    DISPLAY WS-DIGCNT
    STOP RUN.

200-ADD-DIGITS-TO-TABLE.
    OPEN INPUT IN-FILE
        PERFORM VARYING INX-A FROM 1 BY 1 UNTIL INX-A > WS-NUM-DIGITS
            READ IN-FILE
                NOT AT END MOVE IN-DIGIT TO WS-DIGIT(INX-A)
            END-READ
        END-PERFORM.
    CLOSE IN-FILE.

200-ADD-DIGITS-TO-TABLE-EXIT.
    EXIT.

300-FIND-ANSWER.
    PERFORM VARYING INX-A FROM 1 BY 1 UNTIL INX-A > WS-HALFWAY
        SET WS-COMP-POS TO INX-A
        ADD WS-HALFWAY TO WS-COMP-POS
        DIVIDE WS-COMP-POS BY WS-NUM-DIGITS 
            GIVING WS-QUOTIENT REMAINDER WS-REMAINDER
        SET INX-B TO WS-REMAINDER
        IF WS-DIGIT(INX-A) IS EQUAL TO WS-DIGIT(INX-B)
            ADD WS-DIGIT(INX-A) TO WS-DIGCNT
        END-IF
    END-PERFORM

    MULTIPLY WS-DIGCNT BY 2 GIVING WS-DIGCNT.

300-FIND-ANSWER-EXIT.
    EXIT.
