*> Sample GnuCOBOL program
IDENTIFICATION DIVISION.
PROGRAM-ID. DAY1_1.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT IN-FILE 
    ASSIGN TO './utils/INPUT1.DAT'
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
    FILE SECTION.
        FD IN-FILE.
        01 IN-DIGIT PIC 9.
    WORKING-STORAGE SECTION.
        01 WS-DIGIT            PIC 9.
        01 WS-FIRST-DIGIT      PIC 9.
        01 WS-PREV-DIGIT       PIC 9.
        01 WS-DIGCNT           PIC 9(4) VALUE 0.
        01 WS-EOF              PIC A(1).

PROCEDURE DIVISION.
100-MAIN.
    OPEN INPUT IN-FILE.
        READ IN-FILE INTO WS-FIRST-DIGIT
            AT END MOVE 'Y' TO WS-EOF
            NOT AT END MOVE WS-FIRST-DIGIT TO WS-PREV-DIGIT
        END-READ

        PERFORM UNTIL WS-EOF IS EQUAL TO 'Y'
            READ IN-FILE INTO WS-DIGIT
                AT END MOVE 'Y' TO WS-EOF
                NOT AT END PERFORM 200-HANDLE-INPUT
            END-READ
        END-PERFORM.
    CLOSE IN-FILE.

    IF WS-PREV-DIGIT IS EQUAL TO WS-FIRST-DIGIT
        ADD WS-PREV-DIGIT TO WS-DIGCNT
    END-IF.

    DISPLAY WS-DIGCNT
EXIT PROGRAM.

200-HANDLE-INPUT.
    IF WS-PREV-DIGIT IS EQUAL TO WS-DIGIT
       ADD WS-PREV-DIGIT TO WS-DIGCNT
    END-IF

    MOVE WS-DIGIT TO WS-PREV-DIGIT.
